Kelly-Coffey/stm32/f303re_usb_cdc/Src/DAP.c
/**
 * @file    DAP.c
 * @brief   Implementation of DAP.h
 *
 * DAPLink Interface Firmware
 * Copyright (c) 2009-2016, ARM Limited, All Rights Reserved
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License"); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include "stm32f3xx_hal.h"
#include "main.h"
#include "string.h"
#include "DAP.h"
#include "stdio.h"

#define DAP_FW_VER      "1.0"   // Firmware Version

#define CPU_CLOCK             72000000        ///< Specifies the CPU Clock in Hz
#define IO_PORT_WRITE_CYCLES  2 ///< I/O Cycles: 2=default, 1=Cortex-M0+ fast I/0
#define DAP_DEFAULT_SWJ_CLOCK 5000000         ///< Default SWD/JTAG clock frequency in Hz.

#define DAP_PACKET_SIZE  64
#define DAP_PACKET_COUNT  1

#define MAX_SWJ_CLOCK(delay_cycles) \
  (CPU_CLOCK/2 / (IO_PORT_WRITE_CYCLES + delay_cycles))

#define CLOCK_DELAY(swj_clock) \
  ((CPU_CLOCK/2 / swj_clock) - IO_PORT_WRITE_CYCLES)

DAP_Data_t DAP_Data;            // DAP Data
__IO uint8_t DAP_TransferAbort; // Transfer Abort Flag

const char DAP_FW_Ver [] = DAP_FW_VER;

static void PORT_SWD_SETUP(void)
{
  GPIO_InitTypeDef GPIO_InitStruct;

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(SWCLK_GPIO_Port, SWCLK_Pin, GPIO_PIN_SET);
  HAL_GPIO_WritePin(SWDIO_GPIO_Port, SWDIO_Pin, GPIO_PIN_SET);

  /*Configure GPIO pin : SWDIO_Pin & SWCLK_Pin */
  GPIO_InitStruct.Pin = SWDIO_Pin | SWCLK_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(SWDIO_GPIO_Port, &GPIO_InitStruct);
}

/** Disable JTAG/SWD I/O Pins.
Disables the DAP Hardware I/O pins which configures:
 - TCK/SWCLK, TMS/SWDIO, TDI, TDO, nTRST, nRESET to High-Z mode.
*/
static void PORT_OFF(void)
{
  GPIO_InitTypeDef GPIO_InitStruct;

  /*Configure GPIO pin : SWDIO_Pin & SWCLK_Pin */
  GPIO_InitStruct.Pin = SWDIO_Pin | SWCLK_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(SWDIO_GPIO_Port, &GPIO_InitStruct);
}

// SWCLK/TCK I/O pin -------------------------------------

/** SWCLK/TCK I/O pin: Get Input.
\return Current status of the SWCLK/TCK DAP hardware I/O pin.
*/
static uint32_t PIN_SWCLK_TCK_IN(void)
{
  return HAL_GPIO_ReadPin(SWCLK_GPIO_Port, SWCLK_Pin);
}

/** SWCLK/TCK I/O pin: Set Output to High.
Set the SWCLK/TCK DAP hardware I/O pin to high level.
*/
static void     PIN_SWCLK_TCK_SET(void)
{
  HAL_GPIO_WritePin(SWCLK_GPIO_Port, SWCLK_Pin, SET);
}

/** SWCLK/TCK I/O pin: Set Output to Low.
Set the SWCLK/TCK DAP hardware I/O pin to low level.
*/
static void     PIN_SWCLK_TCK_CLR(void)
{
  HAL_GPIO_WritePin(SWCLK_GPIO_Port, SWCLK_Pin, RESET);
}

// SWDIO/TMS Pin I/O --------------------------------------

/** SWDIO/TMS I/O pin: Get Input.
\return Current status of the SWDIO/TMS DAP hardware I/O pin.
*/
static uint32_t PIN_SWDIO_TMS_IN(void)
{
  return HAL_GPIO_ReadPin(SWDIO_GPIO_Port, SWDIO_Pin);
}

/** SWDIO/TMS I/O pin: Set Output to High.
Set the SWDIO/TMS DAP hardware I/O pin to high level.
*/
static void     PIN_SWDIO_TMS_SET(void)
{
  HAL_GPIO_WritePin(SWDIO_GPIO_Port, SWDIO_Pin, SET);
}

/** SWDIO/TMS I/O pin: Set Output to Low.
Set the SWDIO/TMS DAP hardware I/O pin to low level.
*/
static  void     PIN_SWDIO_TMS_CLR(void)
{
  HAL_GPIO_WritePin(SWDIO_GPIO_Port, SWDIO_Pin, RESET);
}

/** SWDIO I/O pin: Get Input (used in SWD mode only).
\return Current status of the SWDIO DAP hardware I/O pin.
*/
static  uint32_t PIN_SWDIO_IN(void)
{
  return HAL_GPIO_ReadPin(SWDIO_GPIO_Port, SWDIO_Pin);
}

/** SWDIO I/O pin: Set Output (used in SWD mode only).
\param bit Output value for the SWDIO DAP hardware I/O pin.
*/
static  void     PIN_SWDIO_OUT(uint32_t bit)
{
  if (bit & 0x1) {
    HAL_GPIO_WritePin(SWDIO_GPIO_Port, SWDIO_Pin, SET);
  } else {
    HAL_GPIO_WritePin(SWDIO_GPIO_Port, SWDIO_Pin, RESET);
  }
}

/** SWDIO I/O pin: Switch to Output mode (used in SWD mode only).
Configure the SWDIO DAP hardware I/O pin to output mode. This function is
called prior \ref PIN_SWDIO_OUT function calls.
*/
static  void     PIN_SWDIO_OUT_ENABLE(void)
{
  GPIO_InitTypeDef GPIO_InitStruct;

  GPIO_InitStruct.Pin = SWDIO_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(SWDIO_GPIO_Port, &GPIO_InitStruct);
}

/** SWDIO I/O pin: Switch to Input mode (used in SWD mode only).
Configure the SWDIO DAP hardware I/O pin to input mode. This function is
called prior \ref PIN_SWDIO_IN function calls.
*/
static  void     PIN_SWDIO_OUT_DISABLE(void)
{
  GPIO_InitTypeDef GPIO_InitStruct;

  GPIO_InitStruct.Pin = SWDIO_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(SWDIO_GPIO_Port, &GPIO_InitStruct);
}

// nRESET Pin I/O------------------------------------------

/** nRESET I/O pin: Get Input.
\return Current status of the nRESET DAP hardware I/O pin.
*/
static  uint32_t PIN_nRESET_IN(void)
{
}

/** nRESET I/O pin: Set Output.
\param bit target device hardware reset pin status:
           - 0: issue a device hardware reset.
           - 1: release device hardware reset.
*/
static  void     PIN_nRESET_OUT(uint32_t bit)
{
}

/** Reset Target Device with custom specific I/O pin or command sequence.
This function allows the optional implementation of a device specific reset sequence.
It is called when the command \ref DAP_ResetTarget and is for example required
when a device needs a time-critical unlock sequence that enables the debug port.
\return 0 = no device specific reset sequence is implemented.\n
        1 = a device specific reset sequence is implemented.
*/
static  uint32_t RESET_TARGET(void)
{
    return (0);              // change to '1' when a device reset sequence is implemented
}

// Get DAP Information
//   id:      info identifier
//   info:    pointer to info data
//   return:  number of bytes in info data
static uint8_t DAP_Info(uint8_t id, uint8_t* info)
{
  uint8_t length = 0;

  switch (id) {
    case DAP_ID_VENDOR:
      break;
    case DAP_ID_PRODUCT:
      break;
    case DAP_ID_SER_NUM:
      break;
    case DAP_ID_FW_VER:
      memcpy(info, DAP_FW_Ver, sizeof(DAP_FW_Ver)+1);
      length = sizeof(DAP_FW_Ver)+1;
      break;
    case DAP_ID_DEVICE_VENDOR:
      break;
    case DAP_ID_DEVICE_NAME:
      break;
    case DAP_ID_CAPABILITIES:
      info[0] = 1;  /* SWD */
      length = 1;
      break;
    case DAP_ID_PACKET_SIZE:
      info[0] = (uint8_t)(DAP_PACKET_SIZE >> 0);
      info[1] = (uint8_t)(DAP_PACKET_SIZE >> 8);
      length = 2;
      break;
    case DAP_ID_PACKET_COUNT:
      info[0] = DAP_PACKET_COUNT;
      length = 1;
      break;
    default:
      break;
  }

  return (length);
}

extern TIM_HandleTypeDef htim6;

// Start Timer
static inline void TIMER_START (uint32_t usec) {
  TIM6->CR1 &= ~TIM_CR1_CEN;
  TIM6->CNT = 0;
  TIM6->PSC = (usec >> 16) * 72 - 1;
  TIM6->ARR = usec - 1;
  TIM6->CR1 |= TIM_CR1_CEN;
}

// Stop Timer
static inline void TIMER_STOP (void) {
  TIM6->CR1 &= ~TIM_CR1_CEN;
}

// Check if Timer expired
static inline uint32_t TIMER_EXPIRED (void) {
  return ((TIM6->CR1 & TIM_CR1_CEN) ? 0 : 1);
}

// Delay for specified time
//    delay:  delay time in ms
void Delayms(uint32_t delay)
{
  delay *= (CPU_CLOCK/1000 + (DELAY_SLOW_CYCLES-1)) / DELAY_SLOW_CYCLES;
  PIN_DELAY_SLOW(delay);
}

// Process Delay command and prepare response
//   request:  pointer to request data
//   response: pointer to response data
//   return:   number of bytes in response
static uint32_t DAP_Delay(uint8_t *request, uint8_t *response)
{
  uint32_t delay;

  delay  = *(request+0) | (*(request+1) << 8);
  delay *= (CPU_CLOCK/1000000 + (DELAY_SLOW_CYCLES-1)) / DELAY_SLOW_CYCLES;

  PIN_DELAY_SLOW(delay);

  *response = DAP_OK;
  return (1);
}

// Process Host Status command and prepare response
//   request:  pointer to request data
//   response: pointer to response data
//   return:   number of bytes in response
static uint32_t DAP_HostStatus(uint8_t *request, uint8_t *response)
{
  switch (*request) {
    case DAP_DEBUGGER_CONNECTED:
      break;
    case DAP_TARGET_RUNNING:
      break;
    default:
      *response = DAP_ERROR;
      return (1);
  }

  *response = DAP_OK;
  return (1);
}

